CSI API ETABS v1

# cTowerGetNameList Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetNameList(
    	ref int NumberNames,
    	ref string[] MyName
    )

    Function GetNameList (
    	ByRef NumberNames As Integer,
    	ByRef MyName As String()
    ) As Integer

    Dim instance As cTower
    Dim NumberNames As Integer
    Dim MyName As String()
    Dim returnValue As Integer

    returnValue = instance.GetNameList(NumberNames,
    	MyName)

    int GetNameList(
    	int% NumberNames,
    	array<String^>^% MyName
    )

    abstract GetNameList :
            NumberNames : int byref *
            MyName : string[] byref -> int

#### Parameters

NumberNames

    Type: SystemInt32

MyName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cTower Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com